In [1]:
import pandas as pd
import pandasql

from pandasql import sqldf 
sql_run = lambda q: sqldf(q, globals())

In [2]:
worldcity = pd.read_csv('https://raw.githubusercontent.com/vertikalwil/Data-Analyst/main/worldcities.csv', sep = ';', encoding = 'latin-1')
uscity = pd.read_csv('https://raw.githubusercontent.com/vertikalwil/Data-Analyst/main/uscities.csv', sep = ';', encoding = 'latin-1')
uscity.columns = ['city', 'state_id', 'state_name', 'county_fips', 'county_name',
       'lat', 'lng', 'population', 'density', 'source', 'military',
       'incorporated', 'timezone', 'ranking', 'zips', 'id']

### Tutorial Bagaimana Cara Melakukan Query Menggunakan Pandasql

Contoh: Bagaimana melakukan query untuk mendapatkan kota-kota dari worldcity yang merupakan:
- berada di antara 33 - 40 'latitude'
- berada di antara 100 - 140 'longitude'
- merupakan kota 'primary' pada kolom 'capital'
- memiliki populasi lebih dari 20 juta

In [3]:
uscity.head()

,city,state_id,state_name,county_fips,county_name,lat,lng,population,density,source,military,incorporated,timezone,ranking,zips,id
0,New York,NY,New York,36061,New York,40.6943,-73.9249,18713220,10715,polygon,False,True,America/New_York,1,11229 11226 11225 11224 11222 11221 11220 1138...,1840034016
1,Los Angeles,CA,California,6037,Los Angeles,34.1139,-118.4068,12750807,3276,polygon,False,True,America/Los_Angeles,1,90291 90293 90292 91316 91311 90037 90031 9000...,1840020491
2,Chicago,IL,Illinois,17031,Cook,41.8373,-87.6862,8604203,4574,polygon,False,True,America/Chicago,1,60018 60649 60641 60640 60643 60642 60645 6064...,1840000494
3,Miami,FL,Florida,12086,Miami-Dade,25.7839,-80.2102,6445545,5019,polygon,False,True,America/New_York,1,33129 33125 33126 33127 33128 33149 33144 3314...,1840015149
4,Dallas,TX,Texas,48113,Dallas,32.7936,-96.7662,5743938,1526,polygon,False,True,America/Chicago,1,75287 75098 75233 75254 75251 75252 75253 7503...,1840019440

In [4]:
worldcity

,city,lat,lng,country,iso2,iso3,capital,population,id
0,Tokyo,35.6897,139.6922,Japan,JP,JPN,primary,37977000.0,1392685764
1,Jakarta,-6.2146,106.8451,Indonesia,ID,IDN,primary,34540000.0,1360771077
2,Delhi,28.6600,77.2300,India,IN,IND,admin,29617000.0,1356872604
3,Mumbai,18.9667,72.8333,India,IN,IND,admin,23355000.0,1356226629
4,Manila,14.6000,120.9833,Philippines,PH,PHL,primary,23088000.0,1608618140
...,...,...,...,...,...,...,...,...,...
40996,Tukchi,57.3670,139.5000,Russia,RU,RUS,NaN,10.0,1643472801
40997,Numto,63.6667,71.3333,Russia,RU,RUS,NaN,10.0,1643985006
40998,Nord,81.7166,-17.8000,Greenland,GL,GRL,NaN,10.0,1304217709
40999,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,NaN,10.0,1304206491
41000,Nordvik,74.0165,111.5100,Russia,RU,RUS,NaN,0.0,1643587468

### Question 1 Point : 40

Temukan kota-kota dari worldcity yang memenuhi semua kondisi ini:
- populasi kota tersebut melebih populasi dari kota terbanyak penduduknya di negara Filipina. (Maksudnya: misalnya kota X adalah kota di Filipina yang paling banyak penduduknya. Kita mau daftar kota-kota yang jumlah penduduknya lebih besar dari kota X tersebut), DAN
- ada kota di Amerika Serikat (uscity) dengan nama kota yang sama dengan kota-kota pilihan

Keluarkan hanya nama kota-kota yang memenuhi 2 syarat di atas saja, tidak usah kolom-kolom lain.

##### NOTE: Hilangkan duplicate rows.

Lakukan hanya 1x query saja, jangan melakukan lebih dari 1 query

In [5]:
#There are many duplicates city in 'Phillipines', we need to sum all the city's populations first by grouping them.
worldcity[worldcity.country == 'Philippines'].city.duplicated().sum()

228

In [6]:
query = """
WITH tabel as 
(SELECT city as kota FROM worldcity
WHERE population > (SELECT MAX(jumlah) FROM (SELECT SUM(population) as jumlah FROM worldcity WHERE country == 'Philippines' GROUP BY city)))

SELECT kota from tabel
WHERE kota IN (SELECT city FROM uscity)
"""
sql_run(query)

    kota
0  Delhi

In [7]:
#check using python pandas to make sure.
df = worldcity[worldcity.population > worldcity[worldcity.country == 'Philippines'].groupby('city')['population'].agg('sum').max()]
df[df.city.isin(uscity.city)].city

2    Delhi
Name: city, dtype: object

### Question 2 Point : 60

Temukan kota-kota di Amerika Serikat (uscity) yang memenuhi semua kondisi berikut:
- memiliki nama 'city' yang tidak sama dengan 'state_name', dan juga
- memiliki populasi di atas rata-rata populasi kota-kota di 'county_name' Miami-Dade, dan juga
- terdiri dari dua atau lebih kata (contoh: Los Angeles, New York)

Output yang diharapkan hanya kolom 'city' saja, tidak usah kolom yang lain

Lakukan hanya 1x query saja, jangan melakukan lebih dari 1 query

In [8]:
#no duplicate city in 'Miami-Dade', Here we can use avg population directly without grouping the city first.
uscity[uscity.county_name == 'Miami-Dade'].city.duplicated().sum()

0

In [9]:
query = """
WITH tabel as 
(SELECT *, LENGTH(city) - LENGTH(replace(city,' ','')) as koma FROM uscity)
SELECT city FROM tabel
WHERE city != state_name AND
population > (SELECT AVG(population) FROM uscity WHERE county_name = 'Miami-Dade') AND
koma > 0
"""
soal2df = sql_run(query)
soal2df

                city
0        Los Angeles
1      San Francisco
2          San Diego
3          Las Vegas
4        San Antonio
..               ...
85        South Lyon
86      Lehigh Acres
87  East Los Angeles
88        St. George
89         Yuba City

[90 rows x 1 columns]

In [10]:
#check using python pandas to make sure.
df = uscity[uscity.city != uscity.state_name]
df = df[df.population > uscity[uscity.county_name == 'Miami-Dade'].population.mean()]
df[df.city.str.count(" ") > 0][['city']].reset_index(drop=True)

                city
0        Los Angeles
1      San Francisco
2          San Diego
3          Las Vegas
4        San Antonio
..               ...
85        South Lyon
86      Lehigh Acres
87  East Los Angeles
88        St. George
89         Yuba City

[90 rows x 1 columns]

In [11]:
df[df.city.str.count(" ") > 0][['city']].reset_index(drop=True).equals(soal2df)

True